import networkx as nx
import matplotlib.pyplot as plt

G = nx.DiGraph()
edges = [
    ('Термінал 1', 'Cклад 1', 25),  # Термінал 1 Склад 1 25
    ('Термінал 1', 'Cклад 2', 20),  # Термінал 1 Склад 2 20
    ('Термінал 1', 'Cклад 3', 15),  # Термінал 1 Склад 3 15
    ('Термінал 2', 'Cклад 3', 15),  # Термінал 2 Склад 3 15
    ('Термінал 2', 'Cклад 4', 30),  # Термінал 2 Склад 4 30
    ('Термінал 2', 'Cклад 2', 10),  # Термінал 2 Склад 2 10
    ('Cклад 1', 'Магазин 1', 15),  # Склад 1 Магазин 1 15
    ('Cклад 1', 'Магазин 2', 10),  # Склад 1 Магазин 2 10
    ('Cклад 1', 'Магазин 3', 20),  # Склад 1 Магазин 3 20
    ('Cклад 2', 'Магазин 4', 15),  # Склад 2 Магазин 4 15
    ('Cклад 2', 'Магазин 5', 10),  # Склад 2 Магазин 5 10
    ('Cклад 2', 'Магазин 6', 25),  # Склад 2 Магазин 6 25
    ('Cклад 3', 'Магазин 7', 20),  # Склад 3 Магазин 7 20
    ('Cклад 3', 'Магазин 8', 15),  # Склад 3 Магазин 8 15
    ('Cклад 3', 'Магазин 9', 10),  # Склад 3 Магазин 9 10
    ('Cклад 4', 'Магазин 10', 20),  # Склад 4 Магазин 10 20
    ('Cклад 4', 'Магазин 11', 10),  # Склад 4 Магазин 11 10
    ('Cклад 4', 'Магазин 12', 15),  # Склад 4 Магазин 12 15
    ('Cклад 4', 'Магазин 13', 5),  # Склад 4 Магазин 13 5
    ('Cклад 4', 'Магазин 14', 10)  # Склад 4 Магазин 14 10
]
G.add_weighted_edges_from(edges)

pos = {
    'Магазин 1': (0, 4),
    'Магазин 2': (1, 4),
    'Магазин 3': (2, 4),
    'Магазин 4': (3, 4),
    'Магазин 5': (4, 4),
    'Магазин 6': (5, 4),
    'Cклад 1': (2, 3),
    'Cклад 2': (4, 3),
    'Термінал 1': (1, 2),
    'Термінал 2': (5, 2),
    'Cклад 3': (2, 1),
    'Cклад 4': (4, 1),
    'Магазин 7': (0, 0),
    'Магазин 8': (1, 0),
    'Магазин 9': (2, 0),
    'Магазин 10': (3, 0),
    'Магазин 11': (4, 0),
    'Магазин 12': (5, 0),
    'Магазин 13': (6, 0),
    'Магазин 14': (7, 0),
}

plt.figure(figsize=(10, 6))
nx.draw(G, pos, with_labels=True, node_size=2000, node_color="skyblue", font_size=12, font_weight="bold", arrows=True)
labels = nx.get_edge_attributes(G, 'weight')
nx.draw_networkx_edge_labels(G, pos, edge_labels=labels)

if __name__ == "__main__":
    plt.show()